In [1]:
import pandas as pd

#### Series

In [3]:
s = pd.Series([56,77,33,12,66,83])

In [4]:
s

0    56
1    77
2    33
3    12
4    66
5    83
dtype: int64

In [5]:
s[4]

66

In [6]:
s[2] = 62
s

0    56
1    77
2    62
3    12
4    66
5    83
dtype: int64

In [7]:
s.size

6

In [8]:
s.min()

12

#### Data Frame

In [10]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['Ajay','Vijaya','Sameer','Priya','Pratap'])
m = pd.Series([67.88, 78.34, 72.86, 83.26, 57.88])

In [12]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})
print(df)

   roll    name  marks
0     1    Ajay  67.88
1     2  Vijaya  78.34
2     3  Sameer  72.86
3     4   Priya  83.26
4     5  Pratap  57.88

In [13]:
df.shape

(5, 3)

In [14]:
df.size

15

In [15]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

#### Read the datasets

In [18]:
# Location: https://mitu.co.in/dataset
# Download all the files starts with name student... 
# Store in current working directory

In [19]:
import os 
os.getcwd()

'/home/mitu/programs/ml/ws/su-feb24'

In [20]:
df = pd.read_csv('student.csv')

In [21]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [22]:
df.shape

(10, 5)

In [23]:
df.size

50

In [25]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [26]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [27]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [28]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [29]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [30]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

#### Index based slicing

In [34]:
x = df.iloc[4:9,1:4]
x

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75

In [35]:
df.iloc[:9,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [36]:
df.iloc[:9,:4]

   roll     name class  marks
0     1     anil    TE  56.77
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75

In [37]:
df.iloc[4:,1:]

     name class  marks  age
4    asha    TE  63.28   20
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23
8    amol    TE  56.75   20
9   anmol    BE  78.66   21

In [38]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
df.iloc[4,1:4]

name      asha
class       TE
marks    63.28
Name: 4, dtype: object

In [40]:
df.iloc[4,:4]

roll         5
name      asha
class       TE
marks    63.28
Name: 4, dtype: object

In [41]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [42]:
df.iloc[[1,7,3,8],:]

   roll     name class  marks  age
1     2     amit    TE  59.77   21
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
8     9     amol    TE  56.75   20

In [44]:
df.iloc[[3,5,6],[1,4]]

      name  age
3  ajinkya   20
5   ayesha   20
6     amar   19

In [45]:
df.iloc[4,3]

63.28

#### Label Based Slicing

In [47]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [48]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [49]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [50]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [51]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [52]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [54]:
df.drop([5,7,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
9    10    anmol    BE  78.66   21

In [56]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [57]:
df.drop(['class','roll'], axis = 1)

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

#### Data import methods

In [60]:
df1 = pd.read_csv('student1.csv')

In [61]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [62]:
cols = ['A','B','C','D','E']
df1 = pd.read_csv('student1.csv', names=cols)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [63]:
df2 = pd.read_csv('student3.tsv')

In [64]:
df2

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [65]:
df2 = pd.read_csv('student3.tsv', sep='\t')

In [66]:
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [67]:
df3 = pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')

KeyboardInterrupt:

In [ ]:
df3

#### Custom column operations

In [68]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [69]:
x = ['M','M','M','M','F','F','M','F','M','M']

In [72]:
df['gender'] = x

In [73]:
df

   roll     name class  marks  age gender
0     1     anil    TE  56.77   22      M
1     2     amit    TE  59.77   21      M
2     3   aniket    BE  76.88   19      M
3     4  ajinkya    TE  69.66   20      M
4     5     asha    TE  63.28   20      F
5     6   ayesha    BE  49.55   20      F
6     7     amar    BE  65.34   19      M
7     8    amita    BE  68.33   23      F
8     9     amol    TE  56.75   20      M
9    10    anmol    BE  78.66   21      M

In [74]:
df['marks'] + 0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [75]:
df['marks'] = df['marks'] + 0.5

In [76]:
df

   roll     name class  marks  age gender
0     1     anil    TE  57.27   22      M
1     2     amit    TE  60.27   21      M
2     3   aniket    BE  77.38   19      M
3     4  ajinkya    TE  70.16   20      M
4     5     asha    TE  63.78   20      F
5     6   ayesha    BE  50.05   20      F
6     7     amar    BE  65.84   19      M
7     8    amita    BE  68.83   23      F
8     9     amol    TE  57.25   20      M
9    10    anmol    BE  79.16   21      M

In [77]:
df['cgpa'] = df['marks'] / 10 + 0.37

In [78]:
df

   roll     name class  marks  age gender   cgpa
0     1     anil    TE  57.27   22      M  6.097
1     2     amit    TE  60.27   21      M  6.397
2     3   aniket    BE  77.38   19      M  8.108
3     4  ajinkya    TE  70.16   20      M  7.386
4     5     asha    TE  63.78   20      F  6.748
5     6   ayesha    BE  50.05   20      F  5.375
6     7     amar    BE  65.84   19      M  6.954
7     8    amita    BE  68.83   23      F  7.253
8     9     amol    TE  57.25   20      M  6.095
9    10    anmol    BE  79.16   21      M  8.286

In [79]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,57.27,60.27,77.38,70.16,63.78,50.05,65.84,68.83,57.25,79.16
age,22,21,19,20,20,20,19,23,20,21
gender,M,M,M,M,F,F,M,F,M,M
cgpa,6.097,6.397,8.108,7.386,6.748,5.375,6.954,7.253,6.095,8.286

#### Connect

In [81]:
# Merge, Join, Concat, Append

In [82]:
ndf = pd.DataFrame({
    'roll': range(1,11),
    'gender': ['M','M','M','M','F','F','M','F','M','M'],
    'cgpa': df['marks'] / 10 + 0.37
})

In [83]:
ndf

   roll gender   cgpa
0     1      M  6.097
1     2      M  6.397
2     3      M  8.108
3     4      M  7.386
4     5      F  6.748
5     6      F  5.375
6     7      M  6.954
7     8      F  7.253
8     9      M  6.095
9    10      M  8.286

In [85]:
df = pd.read_csv('student.csv')

In [86]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [87]:
ndf.columns

Index(['roll', 'gender', 'cgpa'], dtype='object')

In [89]:
df.merge(ndf, on='roll')

   roll     name class  marks  age gender   cgpa
0     1     anil    TE  56.77   22      M  6.097
1     2     amit    TE  59.77   21      M  6.397
2     3   aniket    BE  76.88   19      M  8.108
3     4  ajinkya    TE  69.66   20      M  7.386
4     5     asha    TE  63.28   20      F  6.748
5     6   ayesha    BE  49.55   20      F  5.375
6     7     amar    BE  65.34   19      M  6.954
7     8    amita    BE  68.33   23      F  7.253
8     9     amol    TE  56.75   20      M  6.095
9    10    anmol    BE  78.66   21      M  8.286

In [91]:
df5 = pd.read_csv('student5.csv')

In [92]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [94]:
pd.concat([df, df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

#### Methods or Functions

In [96]:
df['marks'].mean()

64.499

In [97]:
df['marks'].max()

78.66

In [99]:
df['marks'].min()

49.55

In [101]:
df['marks'].sum()

644.9899999999999

In [102]:
df['marks'].median()

64.31

In [103]:
df['marks'].std()

9.207178901994535

In [104]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [105]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [106]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [107]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [108]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [109]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [110]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [112]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [114]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

#### String opereations

In [118]:
df['name'].str.upper() # lower, title, swapcase

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [119]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [120]:
df['name'].str.count('a')

0    1
1    1
2    1
3    2
4    2
5    2
6    2
7    2
8    1
9    1
Name: name, dtype: int64

In [121]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [122]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

#### Grouping operations

In [124]:
gr = df.groupby('class')

In [126]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [127]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [129]:
gr.agg(sum)

/tmp/ipykernel_20002/21147588.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  gr.agg(sum)

       roll                        name   marks  age
class
BE       34  aniketayeshaamaramitaanmol  338.76  102
TE       21     anilamitajinkyaashaamol  306.23  103

In [130]:
gr.agg(min)

/tmp/ipykernel_20002/1746840280.py:1: FutureWarning: The provided callable <built-in function min> is currently using DataFrameGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  gr.agg(min)

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

#### Boolean Filtering

In [133]:
mask = df['marks'] > 60

In [134]:
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [135]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [136]:
x = df[df['marks'] > 60]
x

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [137]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [138]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [139]:
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

#### Export the data

In [141]:
x.to_csv('output.csv', index=False)

In [142]:
x.to_html('output.html', index = False)